{"meta":{"title":"Webdev","summary":"Listing out my misc notes in article form.","tab":"00_webdev","keywords":"['test','test test']","filename":"webdev"},"content":"<details open class=\"details\">\n <summary> <h2>Links:</h2>\n </summary>  <p> <a href=\"https://blog.jetbrains.com/webstorm/2024/10/javascript-best-practices-2024/?ref=dailydev\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">https://blog.jetbrains.com/webstorm/2024/10/javascript-best-practices-2024/?ref=dailydev</a></p>\n<p> const obj = { name: &#39;Alice&#39; };\n const hiddenKey = Symbol(&#39;hidden&#39;);\n obj[hiddenKey] = &#39;Secret Value&#39;;\n console.log(Object.keys(obj)); // [&#39;name&#39;] (Symbol keys won&#39;t appear)\n console.log(Object.getOwnPropertySymbols(obj)); // [Symbol(hidden)] (accessible only if specifically retrieved)</p>\n<p> Why it matters: Map is a more flexible and predictable way of associating values with any kind of key, whether primitive or non-primitive. It preserves the type and order of keys, unlike plain objects, which convert keys to strings.\n const map = new Map();\n const key = { id: 1 };\n // Using a non-primitive object as a key in a Map\n map.set(key, &#39;value&#39;);\n console.log(map.get(key)); // &#39;value&#39;</p>\n<p> Why it matters: Arrow functions enhance readability by removing boilerplate code, making callback functions and inline expressions much more concise. In addition, they are particularly valuable when working with classes or event handlers, as they automatically bind this to the surrounding lexical scope. This avoids common bugs related to this in traditional function expressions, especially in asynchronous or callback-heavy code.</p>\n<p> Advice: When you really need private fields in classes, JavaScript now has real private fields using the # syntax. This is an official language feature that enforces true privacy.</p>\n<p> class Person {\n   #name\n   constructor(name) {\n     this.#name = name;\n   }\n   getName() {\n     return this.#name\n   }\n }\n const p = new Person(&#39;A&#39;);\n console.log(p.getName()); // &#39;A&#39;\n Why it matters: Using real private fields ensures that the data is truly encapsulated, preventing accidental or malicious access from outside the class. The underscore convention only provides a visual cue and can easily be misused, while # private fields guarantee privacy by design. This results in more robust and maintainable code.</p>\n </details>"}