{"meta":{"filename":"startups"},"content":"<p><a href=\"https://getwaitlist.com/blog/solo-dev-startup-stack\" onclick=\"window.pingServer(this)\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">https://getwaitlist.com/blog/solo-dev-startup-stack</a></p>\n \n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n business isn't about making profit but in reality it's about managing cash flow\n The industry itself had very favourable tax characteristics — smart cable operators could shelter their cash flow from taxes by using debt to build new systems, and by aggressively depreciating the costs of construction.\n \n  He understood that if he used debt to finance acquisitions, he could keep growing the company, and use the depreciation on acquired systems (plus the write-offs from the loans itself) to delay paying taxes on that cash flow.\n \n Malone understood that untaxed cash flows from all of those cable subscribers could be used to a) service the debt, b) pay down some of those loans — only when necessary; Malone wanted to keep the debt-to-earnings ratio at a five-to-one level — but more importantly c) demonstrate to creditors that TCI was a worthy debtor\n \n Tax shelter: High interest payments + big write-offs + w/ losses\n net neutral through loans for growth negating profits and increasing net wealth. \n \n Amazon is a classic fixed cost business model, it uses the internet to get maximum leverage out of its fixed assets, and once it achieves enough volume of sales, the sum total of profits from all those sales exceed its fixed cost base, and it turns a profit.\n \n Very early in my career at Amazon, we could already easily model out and see when our revenue would give us enough income to exceed our fixed cost bas\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n \n Cliffs&Coasts makes custom jewelry out of geography. Customers have two option to create a design, either by using the elevation of a path, or by selecting a portion of an area's border. The jewelry is then laser-cut or 3D-printed.\n \n CA Coastline Ring is created from the California coastline, and then 3D-printed in either silver or brass. The design was created from Natural Earth data, converting the geoJSON into SVG and then manipulating the design in Illustrator. The coastline is exaggerated on the final ring to make the design printable by current 3D printing standards.\n \n Monochōme is a site for designing custom one-off clothing and accessories, decorated with map tiles. Visitors can search for any city or address, pan or zoom the map until they're happy with their design, and viola!\n \n ManyMaps is a site for designing your own map prints. The site is built on Shopify, and I made the site end-to-end, including concept, frontend and backend code, visual design, and photography.\n \n Gifpop! is a service to make one-off lenticular prints, AKA physical gifs.\n \n The site is a collaboration between Sha Hwang and myself, with design help from Chris Delbuck. We are also tremendously fortunate to work with a collection of GIF artists to make prints of their work.\n \n I found a manufacturer that did custom mirror engravings... so of course I sent over a lil vector map, and this was the result! I can't imagine that people would want this at scale... but it is fun to have a tiny SF mirror.\n \n Postcard Gifts is a site for creating, scheduling, and sending custom postcards. Site is built on top of Beluga, using a React/Node/Postgres stack. Gabriel Labov Dunne helped me set up the database/backend of the site.\n \n GPX Jewelry is custom-made jewelry, based on GPS tracks!\n UI allows a user to upload a .gpx file, which then creates the design for the necklace. The site is built on Beluga, with a MongoDB backend to save the designs.\n \n Describe the typical workflow from order to shipment\n \n Since each piece is made to order, once orders are placed they go into production. Production usually takes a couple weeks. Once ready, orders are shipped and, depending on where the order is going, it takes anywhere from a few days to another couple of weeks for delivery. The only real variable in the workflow is each country’s customs. Otherwise, things are pretty much the same.  \n \n What has been your biggest hurdle with manufacturing?\n \n The work that I produce is done on a very small scale and stays true to techniques that are historical to hand binderies. I don’t work with manufacturers to develop any part of my products. I certainly purchase materials that are produced in mass, but many of my materials, such as handmade papers and leather, come from individual craftsman and small independent businesses that are creating products for the bookbinding community.  \n \n What is your busy season like?\n \n My busiest season is directly before and after the holidays. This part of the year brings more commissions into the studio. Balancing a larger workload with constraining deadlines can be difficult and taxing and I tend to work late into the night during the holiday season.\n I also deal with clients who request completed projects within unobtainable deadlines. One of my roles as a bookbinder is to educate my clients about the binding process.\n \n Describe the typical workflow from order to shipment\n \n When an order comes in, we kick off a custom script that downloads all the places that are going to be in a deck, generates a map for each one, and writes a little data file with all the info in it. Then this data file gets passed to InDesign which assembles a huge double-sided page with all the cards laid out. We then manually check each deck before sending it to print. The deck gets printed and cut at our print partner (LEFA Print – they’re amazing) and shipped to the customer. We like to make it seem like the process is completely automated, but actually, we have deliberately introduced points where the process pauses for QA to make sure nothing goes out to the customer that isn’t right. (In theory.)\n \n What has been your biggest hurdle with manufacturing?\n \n Corner rounding! (Not really.) The biggest hurdle was actually figuring out how to make producing a single deck (rather than e.g. a run of 100) as efficient a process as possible so it could be economically viable. We ended up achieving this by printing each deck on to a single sheet of paper, and then using specialised digital cutting equipment to cut the deck out.\n \n \n What is your busy season like?\n Lots of looking at auto-generated InDesign documents. Lots of email. Because we don’t usually touch the physical product, our office looks the same. We just talk less.\n \n \n Describe the typical workflow from order to shipment\n We use Amazon FBA for fulfillment, so the entire process is a mercifully passive one for us. But Monikers got its start as a Kickstarter\n \n Describe the typical workflow from order to shipment:\n \n Every bottle is made by hand out of our commercial kitchen in Brooklyn. The honey is delivered from our friends at Honeybrook Farms in the Hudson Valley and the syrup comes down from Catskill Mountain Sugar House in the Catskills. I infuse the products in large bottling tanks, usually 50-75 gallons at a time, and let it sit at temperature until it’s time to bottle. Until recently, I was doing all of the bottling myself (with a lot of help from friends in times of crisis!), but now I have Nicole (my sanity savor) who comes in a few days a week to tackle the tanks. As soon as Nicole empties one bottling tank, I start the next batch for infusion.\n \n  The bad news was our bottle supplier went on back order, so everything had to be filled and shipped in a two week period.\n \n Any shipping horror stories?\n \n Back to the holidays again. We were shipping everything out of my apartment and I would load up a U-Haul with huge garbage bags stuffed with boxes. My local post office got to know me real quick, and luckily slipping them a couple bottles of Bees Knees Spicy Honey immediately led to special treatment on my daily visits. \n \n What is the most surprising thing you’ve found from making physical products?\n \n The most surprising thing is that physical products require space! I still remember one day when we received a massive packaging shipment of over 100 boxes that I had to figure out where to store\n \n Describe the typical workflow from order to shipment\n  When we get an order I get a notification on my phone. I love getting this “ping” sound. Every single scarf is numbered and packaged with care in a little black box along with it’s scientific description, a little care message on how to take care of the silk, and a space ice cream candy sometimes. We ship using USPS, the packages are white and have a little sticker on them when we are finished packing them. Everything is packed from our HQ in Brooklyn which is also my home. The sticker touch at the end reminds me of Miranda July when she touches her little round stickers in You, me and everyone we know. It’s like trying to connect the dots between us and the recipient of the package.\n \n What is your busy season like?\n Our busy season is very hectic. We pack almost all day and take different trips to the post office. It’s very physical, we lift boxes and chip our nail polish, but I am so grateful to still be able to do the shipping myself along with our team because it gives each package the care and precision it needs - and I think people notice, we often get instagram mentions with people taking pictures of their packages when they arrive and when they open them. It’s part of the experience.\n \n \n Describe the typical workflow from order to shipment\n \n Visitors to Coastermatic.com log in with their Instagram account and can pick up to 4 images to be printed on our coasters. Once they check out, Shopify sends the photos they picked to the Coastermatic server, which goes and downloads them all. Once a day we go in and process orders - this means running some code that preps the images for print, uploading shipping labels from ShipStation, and packaging it all up for our manufacturer. Our manufacturer then prints the coasters and ships them out.\n \n What is your busy season like?\n \n Like most e-commerce businesses, Coastermatic’s busy season is in November and December. Pretty much, our sales quadruple. Since most of our order processing is automated, things don’t change too much for us on that end. Customer support, on the other hand, gets kinda crazy. People seem to get very frantic about their coasters the later it gets in the season.\n \n Describe the typical workflow from order to shipment\n \n I try to keep things pretty simple since I do most of it myself. I only sell items I either have in stock and can be shipped immediately for direct sales or are large custom or wholesale orders with long lead times (6-8 weeks). I used to allow people to order items at any time, but making items to order was extremely inefficient (and stressful).\n With web orders, I’m notified via email, and I simply locate the items, pack them up, and ship. My shipping program automatically imports my orders, so I just need to choose the method and provide the final weight/dimensions. I have inventory and packing materials ready to go, so it’s all pretty easy. And I try to schedule pickups, so I don’t have to make shipping runs.\n \n \n Tell us about your background \n \n I (Gabe) am a web developer with a focus on location data and gaming. I have an architecture degree and love crafting things out of cardboard, paper and wood. Catherine, my wife and business partner, is a games producer with an incredible skill for operations, management and logistics and a love for crafts and natural materials.\n \n Describe the typical workflow from order to shipment\n \n Each map goes through a fabrication cycle with many automated and manual steps. First, laser-cutter compatible SVG files are generated by our software, one for each layer of wood. We verify each design by hand to ensure there aren’t small details that would be too fragile or impossible to assemble. We send these files through dropbox to either our laser console or, for larger maps, an outside shop that we trust and love (Pagoda Arts). After cutting, each map is hand assembled, like a giant jigsaw puzzle. The combined design is then glued to a backing substrate, vacuum-pressed to dry, sanded, finished, packed, and sent to its destination!\n \n What has been your biggest hurdle with manufacturing?\n \n Our inlay process requires a lot of skillful manual attention, which makes it slow to train up new people and count on good results. In addition, our backlog is highly variable, with huge spikes on the holidays and on bulk orders. This makes staffing a challenge.\n \n Plastique* is a jewelry company specializing in plastic and enamel designs\n \n Tell us about your background:\n \n My background is in graphic design. I have worked for companies in both the in-house and agency capacity. I used to do a lot of marketing materials, web and mobile design and some brand identity.\n \n Describe the typical workflow from order to shipment:\n \n I receive orders from various types of platforms including my own website and Etsy to sites like Brit+Co and Fab.com where it’s a dropship situation. I also wholesale. When it comes to regular non-wholesale orders I usually have the inventory already made so the process is fairly simple. Print order. Pack order. Ship order. Very quick, easy and straightforward. If the order is wholesale then I might have to make some pieces to order in which case I will set aside time for that and/or order more components to then make those pieces. If the order is a custom order I walk through the design process with the client showing them digital mockups before creating the final piece.\n \n \n These Are Things is an animation studio and paper goods brand based out of Ohio.\n \n Tell us about your background\n \n We both went to art school for “Advertising & Graphic Design.” Afterwards, Jen did freelance design work and taught and I worked at a small motion graphics studio. We were both heavy computer users when we were younger and had our own hand-coded websites/blogs when we were in middle school.\n \n Describe the typical workflow from order to shipment \n We use Shopify for our ecommerce platform. When a customer places an order, a notification is sent to our phone and the order is automatically placed into our shipping software (Shipstation). At the beginning of the day, we generate all our order labels from Shipstation and print them at our warehouse studio. From there we pick and package our stock inventory and print any custom or personalized orders. From there we either drop off the packages at our local USPS hub, or if there are too many, we have a postman come pick them up.\n \n What is the most surprising thing you’ve found from making physical products?\n \n How much space they take up! Not only do you have to account for the actual products, but all the packaging, promotional items, packing supplies, and about a million other things. As the business grows, so does the volume of stuff we have to have and the amount of space we need to store it all. We started out using a corner of a one-bedroom apartment and now are bursting at the seams in a 1200 square foot warehouse. It can be a bit overwhelming at times :)\n \n What has been your biggest hurdle with manufacturing?\n Making physical things is hard. Making physical things in mass quantities is even harder! Since we don’t print our posters ourselves, the biggest hurdle was finding the right partners to work with. We have to balance budget, speed and quality with every single product we make. Sometimes we have a great idea, but the price to produce it makes it an impossible sell so we have to just move on.\n \n \n Describe the typical workflow from order to shipment\n \n Currently we fulfill Lumi products in house, though in the past we have outsourced fulfillment to various companies. Orders come in through Shopify or our custom backend, we generate a shipping label via OrderCup and have scheduled pickups every day from UPS and USPS. For wholesale orders things are much more tailored to each retailer as we are often shipping pallets of product via freight companies.\n \n \n What is the most surprising thing you’ve found from making physical products?\n \n Working with retailers is hard. Small retailers want to order your products through distributors in the smallest quantities possible and big retailers want to pay you 60-90 days after delivery. Taking time to understand how cash flow actually affects a business is paramount. Even if your products are profitable, cash flow can severely impact how you grow. If you can work directly with your customers, do so.\n \n What has been your biggest hurdle with manufacturing?\n \n No one cares about your product as much as you do. If you rely too much on third parties you will find that quality can begin to slip. Moreover, companies that sell manufacturing services need to make a profit on the labor so costs can be higher than necessary. Our products are relatively simple to manufacture so we have gradually brought more and more production in-house where we can strictly control the quality. We found that investments in certain pieces of equipment that initially seemed expensive were paid off within months and resulted in much higher quality products.\n \n https://www.lumi.com/features\n https://belugajs.com/docs/managing-orders\n If you know that you will always be using one shipping provider, consider making the tracking number a link in the email template (/emails/Ordered/html.hbs). Here's an example, if you were using USPS:\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n"}