{"meta":{"title":"Correlation","summary":"Assorted notes on the topic. Near entirly quotes from other sources.","tab":"Correlation","keywords":"['data']","hide_sitemap":"false","hide_toc":"true","hide_breadcrumbs":"false","filename":"clustering_association_notes"},"content":"<p><a href=\"https://s2.smu.edu/~mhahsler/crawler_test/michael.hahsler.net/research/association_rules/measures.html\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Measures for the support-confidence framework for mining association rules</a>:</p>\n<ul>\n<li><strong>Support</strong></li>\n<li><strong>Confidence</strong></li>\n</ul>\n<p> Some alternative measures:</p>\n<ul>\n<li>All-confidence</li>\n<li>Collective strength</li>\n<li>Conviction</li>\n<li>Coverage</li>\n<li>Leverage</li>\n<li>Lift (originally called interest)</li>\n<li>Other measures</li>\n</ul>\n <p><a href=\"http://users.stat.umn.edu/~helwig/notes/npind-Notes.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Notes on Nonparametric Independence Tests</a></p>\n<p> Kendall’s Rank Correlation: </p>\n<p> Spearman’s Rank Correlation:</p>\n<p> Suppose we have n bivariate observations </p>\n<p> (X1, Y1), . . . ,(Xn, Yn) where (Xi , Yi) is i-th subject’s data </p>\n<p> We want to make inferences about association between X and Y </p>\n<p> Let FX,Y denote joint distribution of X and Y </p>\n<p> Let FX and FY denote marginal distributions of X and Y </p>\n<p> Null hypothesis is statistical independence: </p>\n<p> FX,Y (x, y) = FX (x)FY (y) for all (x, y)</p>\n<p> Independence assumption<div>n i=1 are iid from some bivariate population Continuity assumption</div> FX,Y is a continuous distribution</p>\n<p> some use cases for graph algorithms:</p>\n<ul>\n<li>real-time fraud detection</li>\n<li>real-time recommendations</li>\n<li>streamline regulatory compliance</li>\n<li>management and monitoring of complex networks</li>\n<li>identity and access management</li>\n<li>social applications/features</li>\n</ul>\n<p> There are 3 main categories of graph algorithms that are currently supported in most frameworks (networkx in Python, or in Neo4J for example) :</p>\n<ul>\n<li>Pathfinding: identify the optimal path depending on availability and quality for example. We’ll also include search algorithms in this category. This can be used to identify the quickest route or traffic routing for example.</li>\n<li>Centrality: determine the importance of the nodes in the network. This can be used to identify influencers in social media for example or identify potential attack targets in a network</li>\n<li>Community detection: evaluate how a group is clustered. This can be used to segment customers and detect fraud for example.</li>\n</ul>\n <h2>Clustering</h2>\n <p><a href=\"http://users.stat.umn.edu/~helwig/notes/cluster-Notes.pdf\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">http://users.stat.umn.edu/~helwig/notes/cluster-Notes.pdf</a></p>\n<p> Let x = (x1, . . . , xp) 0 and y = (y1, . . . , yp) 0 denote two arbitrary vectors. \n Problem: We want some rule that measures the “closeness” or “similarity” between x and y. </p>\n<p> How we define closeness (or similarity) will determine how we group the objects into clusters. </p>\n<p> Rule 1: Pearson correlation between x and y </p>\n<p> Rule 2: e Minkowski Metric (Manhattan, Euclidean, Chebyshev) distance between x and y </p>\n<p> Rule 3: Number of matches, i.e., Pp j=1 1{xj=yj} </p>\n<p> <strong>Hierarchical clustering</strong> uses a series of successive mergers or divisions to group N objects based on some distance. </p>\n<p> <strong>Agglomerative Hierarchical Clustering</strong> (bottom up) 1 Begin with N clusters (each object is own cluster) 2 Merge the most similar objects 3 Repeat 2 until all objects are in the same cluster </p>\n<p> <strong>Divisive Hierarchical Clustering</strong> (top down) 1 Begin with 1 cluster (all objects together) 2 Split the most dissimilar objects 3 Repeat 2 until all objects are in their own cluster</p>\n<p> We know how to define dissimilarity between objects (i.e., duv ), but how do we define dissimilarity between clusters of objects?</p>\n<p> To quantify the distance between two clusters, we could use: </p>\n<ul>\n<li>Single Linkage: minimum (or nearest neighbor) distance</li>\n<li>Complete Linkage: maximum (or furthest neighbor) distance </li>\n<li>Average Linkage: average (across all pairs) distance</li>\n</ul>\n <p> Non-hierarchical clustering partitions a set of N objects into K distinct groups based on some distance (or dissimilarity). The number of clusters K can be known a priori or can be estimated as a part of the procedure.</p>\n<p> Why are Permutations Useful for Statistics? Classic statistical paradigm is: collect some data form null hypothesis H0 design test statistic derive sampling distribution of test statistic under H0 In many cases, the null hypothesis is the nil hypothesis, i.e., no effect. Under the nil hypothesis, all possible outcomes (permutations) are equally likely, so permutations relate to sampling distributions.</p>\n<p> Principal Components Analysis (PCA) finds linear combinations of variables that best explain the covariation structure of the variables. There are two typical purposes of PCA: 1 Data reduction: explain covariation between p variables using r &lt; p linear combinations 2 Data interpretation: find features (i.e., components) that are important for explaining covariation</p>\n<p> The data matrix refers to the array of numbers X =   {x11 x1p,  x21 x2p, xn1 xnp} where xij is the j-th variable collected from the i-th item (e.g., subject). \n items/subjects are rows variables are columns X is a data matrix of order n × p \n (# items by # variables).</p>\n  "}