{"meta":{"filename":"legal","title":"Legal","summary":"Terms, Condtions, Disclaimers, Licensing listed here:","badges":"false","comments":"false","hide":"false","image":"images/company_logo.png","keywords":"['voxels', 'metaverse', 'navigation']","tab":"Legal","template":"template_article","sitemap":"secondmap.json","toc":"false"},"content":" <p>BY USING THIS SITE AND ANY AFFILIATED PRODUCTS/ SERVICES YOU AGREE TO <br></p>\n<ul>\n<li>FOLLOWING THESE <a href='https://www.cryptovoxels.com/terms'>TERMS OF SERVICE</a><br></li>\n<li>FOLLOWING THIS <a href='https://www.cryptovoxels.com/conduct'>CODE OF CONDUCT</a><br></li>\n<li>ACCEPTING THIS <a href='https://www.cryptovoxels.com/privacy'>PRIVACY POLICY</a><br>\n WHEREVER APPLICABLE, HOWEVER BEST APPLICABLE.</li>\n</ul>\n <p> <b>CONTACT ME</b> <br>\n For more information about privacy practices, if you have questions, or if you would like to make a complaint, please contact me by e-mail at charles.karpat@gmail.com </p> <details open class='details'>\n <summary> <h2 id=\"disclaimer\">Disclaimer</h2>\n </summary> <p><b>Views Expressed</b>: All views expressed are the authors own and do not represent the opinions of any entity whatsover with which they have been, are now, or will be affiliated.</p>\n<p> <b>Responsibility</b>, Errors and Ommissions: The author makes no assurance about the reliability of the information. The author makes takes no responsibility for updating product nor maintaining any porformant status. Under no circumstances shall the Author or its affiliates be liable for any indirect incedental, consequential, or special and or exemplary damages arising out of or in connection with this  site and related products. Information is provided &#39;as is&#39; with distinct plausability of errors and ommitions. Information found within the contents is attached with an MIT license. Please refer to the License for more information.</p>\n<p> <b>Use at Risk</b>: Any action you take upon the information or tooling provided is strictly at your own risk, and the author will not be liable for any losses and damages in connection with the use of this site and related products.</p>\n<p> Fair Use this site contains copyrighted material the use of which has not always been specifically authorized by the copyright owner. While no intention is made to unlawfully use copyrighted work, circumstanes may arise in which such material is made available in effort to advance scientific literacy. We believe this constitutes a &#39;fair use&#39; of any such copyrighted material as provided for in section 107 of the US Copyright Law. In accordance with Titile 17 U.S.C. Section 108, the material on this site is distributed without profit to those who have expressed a prior interest in receiving the included information for research and education purposes.</p>\n<p> for more information go to: <a href=\"http://www.law.cornell.edu/uscode/17/107.shtml\">http://www.law.cornell.edu/uscode/17/107.shtml</a>. If you wish to use copyrighted material from this site for purposes of your own that go beyond &#39;fair use&#39;, you must obtain permission from the copyright owner.</p>\n </details> <!-- End Disclaimer section -->\n <details>\n <summary> <h2 id=\"license\">License</h2>\n </summary> <p>Copyright © 2022 Charles Karpati</p>\n<p> Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the &quot;Software&quot;), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:</p>\n<p> The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.</p>\n<p> THE SOFTWARE IS PROVIDED &quot;AS IS&quot;, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.</p>\n </details> <!-- End License section --> "}